# DF composite

In [1]:
import numpy as np
import pandas as pd

## merge

In [3]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [5]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [6]:
# inner join
pd.merge(df1, df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [8]:
# left outer join
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [9]:
# right outer join
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [10]:
# full outer join
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [11]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [13]:
df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [14]:
pd.merge(df1, df2, on='고객명')

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

## same col name not exist

In [15]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [16]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

## join method

In [22]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1.set_index('고객번호', inplace=True)
df1

       이름
고객번호
1001   둘리
1002  도우너
1003   또치
1004   길동
1005   희동
1006  마이콜
1007   영희

In [23]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2.set_index('고객번호', inplace=True)
df2

          금액
고객번호
1001   10000
1001   20000
1005   15000
1006    5000
1008  100000
1001   30000

In [24]:
df1.join(df2, how='inner')

       이름     금액
고객번호
1001   둘리  10000
1001   둘리  20000
1001   둘리  30000
1005   희동  15000
1006  마이콜   5000

In [25]:
df1.join(df2)

       이름       금액
고객번호
1001   둘리  10000.0
1001   둘리  20000.0
1001   둘리  30000.0
1002  도우너      NaN
1003   또치      NaN
1004   길동      NaN
1005   희동  15000.0
1006  마이콜   5000.0
1007   영희      NaN

## concat func

In [26]:
s1 = pd.Series([0,1], index=['A','B'])
s1

A    0
B    1
dtype: int64

In [27]:
s2 = pd.Series([2,3,4], index=['A','B','C'])
s2

A    2
B    3
C    4
dtype: int64

In [28]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [29]:
df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['서울', '부산'])
df1

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [30]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [31]:
pd.concat([df1, df2], axis=1)

    서울   부산  데이터3  데이터4
a  1.0  2.0   5.0   6.0
c  3.0  4.0   7.0   8.0
e  5.0  6.0   NaN   NaN

## quiz2

In [47]:
df1 = pd.DataFrame(np.random.randint(100, 1000, size=(6,2)),
                   columns = ['매출', '비용'],
                   index = ['1월', '2월', '3월', '4월', '5월', '6월']
                    )
df1['이익'] = df1['매출'] - df1['비용']
df1

     매출   비용   이익
1월  641  342  299
2월  155  808 -653
3월  686  829 -143
4월  122  879 -757
5월  276  548 -272
6월  698  628   70

In [48]:
df2 = pd.DataFrame(np.random.randint(100, 1000, size=(6,2)),
                   columns = ['매출', '비용'],
                   index = ['7월', '8월', '9월', '10월', '11월', '12월']
                    )
df2['이익'] = df2['매출'] - df2['비용']
df2

      매출   비용   이익
7월   776  332  444
8월   610  834 -224
9월   711  569  142
10월  873  423  450
11월  238  741 -503
12월  714  809  -95

In [49]:
df = pd.concat([df1, df2])
df

      매출   비용   이익
1월   641  342  299
2월   155  808 -653
3월   686  829 -143
4월   122  879 -757
5월   276  548 -272
6월   698  628   70
7월   776  332  444
8월   610  834 -224
9월   711  569  142
10월  873  423  450
11월  238  741 -503
12월  714  809  -95

In [51]:
tdf = pd.DataFrame(df.sum()).T
tdf

     매출    비용    이익
0  6500  7742 -1242

In [52]:
tdf.index = ['합계']
tdf

      매출    비용    이익
합계  6500  7742 -1242

In [53]:
df = pd.concat([df, tdf])
df

       매출    비용    이익
1월    641   342   299
2월    155   808  -653
3월    686   829  -143
4월    122   879  -757
5월    276   548  -272
6월    698   628    70
7월    776   332   444
8월    610   834  -224
9월    711   569   142
10월   873   423   450
11월   238   741  -503
12월   714   809   -95
합계   6500  7742 -1242